## Series Object

In [1]:
import pandas as pd

a = [1, 2, 3, 4, 5]
series = pd.Series(a)
print(series)
type(series)

0    1
1    2
2    3
3    4
4    5
dtype: int64

pandas.core.series.Series

In [4]:
#changing the index

series_index = pd.Series(a, index=['a','b','c','d','e'])
series_index

a    1
b    2
c    3
d    4
e    5
dtype: int64

## Data Frame

In [5]:
#creating a dataframe using list
## note data frame 2D/multidimensional array where as series single dimension array

import pandas as pd

a = [1,2,3,4,5]
dataframe = pd.DataFrame(a)
dataframe

   0
0  1
1  2
2  3
3  4
4  5

In [8]:
#creating dataframe using a dictionary
b = {'name': ['Aayush', 'Bipasha', 'Ojas'], 'age': [22, 19, 18]}
dataframe_dict = pd.DataFrame(b)
dataframe_dict

      name  age
0   Aayush   22
1  Bipasha   19
2     Ojas   18

In [9]:
#converting 1D series to 2D dataframe
a = pd.Series([1,2,3,4,5], index=['a','b','c','d','e'])
df = pd.DataFrame(a)
df

   0
a  1
b  2
c  3
d  4
e  5

## Numpy Array

In [4]:
import numpy as np
import pandas as pd

arr = np.array([[30000, 40000], ['Madan', 'Krishna']])
df = pd.DataFrame({'name': arr[1], 'salary': arr[0]}, index=['i', 'ii'])
df

       name salary
i     Madan  30000
ii  Krishna  40000

## Merge and Joint Operations with DataFrame

In [24]:
import pandas as pd

team = ['Man Utd', 'Arsenal', 'Chelsea']
points = [92, 70, 83]
season = ['2012 season', '2013 season', '2015 season']

#creating a dataframe from the lists

df = pd.DataFrame({'Team Name': team, 'Points': points, 'Season': season})
df

  Team Name  Points       Season
0   Man Utd      92  2012 season
1   Arsenal      70  2013 season
2   Chelsea      83  2015 season

In [25]:
# creating second dataframe
player = ['Wayne Rooney', 'David Luiz', 'Ross Barkley']
points = [100, 20, 40]
season = ['2018 season', '2019 season', '2015 season']

df1 = pd.DataFrame({'Players': player, 'Points': points, 'Season': season})
df1

        Players  Points       Season
0  Wayne Rooney     100  2018 season
1    David Luiz      20  2019 season
2  Ross Barkley      40  2015 season

### Inner Merge

In [26]:
df.merge(df1, on="Season", how="inner")

  Team Name  Points_x       Season       Players  Points_y
0   Chelsea        83  2015 season  Ross Barkley        40

### Left Merge

In [27]:
df.merge(df1, on="Season", how="left")

  Team Name  Points_x       Season       Players  Points_y
0   Man Utd        92  2012 season           NaN       NaN
1   Arsenal        70  2013 season           NaN       NaN
2   Chelsea        83  2015 season  Ross Barkley      40.0

### Right Merge

In [28]:
df.merge(df1, on="Season", how="right")

  Team Name  Points_x       Season       Players  Points_y
0   Chelsea      83.0  2015 season  Ross Barkley        40
1       NaN       NaN  2018 season  Wayne Rooney       100
2       NaN       NaN  2019 season    David Luiz        20

### Outer Merge

In [29]:
df.merge(df1, on="Season", how="outer")

  Team Name  Points_x       Season       Players  Points_y
0   Man Utd      92.0  2012 season           NaN       NaN
1   Arsenal      70.0  2013 season           NaN       NaN
2   Chelsea      83.0  2015 season  Ross Barkley      40.0
3       NaN       NaN  2018 season  Wayne Rooney     100.0
4       NaN       NaN  2019 season    David Luiz      20.0

### Joint Operation

In [30]:
# must have index value because 

team = ['Man Utd', 'Arsenal', 'Chelsea']
points = [92, 70, 83]
season = ['2012 season', '2013 season', '2015 season']

#creating a dataframe from the lists

df2 = pd.DataFrame({'Team Name': team, 'Point': points, 'Seasons': season}, index=['L1','L2','L3'])
df2

   Team Name  Point      Seasons
L1   Man Utd     92  2012 season
L2   Arsenal     70  2013 season
L3   Chelsea     83  2015 season

In [31]:
player = ['Wayne Rooney', 'David Luiz', 'Ross Barkley']
points = [100, 20, 40]
season = ['2018 season', '2019 season', '2015 season']

df3 = pd.DataFrame({'Players': player, 'Points': points, 'Season': season}, index=['L2', 'L3', 'L4'])
df3

         Players  Points       Season
L2  Wayne Rooney     100  2018 season
L3    David Luiz      20  2019 season
L4  Ross Barkley      40  2015 season

In [32]:
# inner join

df2.join(df3, how="inner")

# note that the columns name should be unique too

   Team Name  Point      Seasons       Players  Points       Season
L2   Arsenal     70  2013 season  Wayne Rooney     100  2018 season
L3   Chelsea     83  2015 season    David Luiz      20  2019 season

In [33]:
# left join
# all the data from the left data frame and all the common data from right
df2.join(df3, how="left")

   Team Name  Point      Seasons       Players  Points       Season
L1   Man Utd     92  2012 season           NaN     NaN          NaN
L2   Arsenal     70  2013 season  Wayne Rooney   100.0  2018 season
L3   Chelsea     83  2015 season    David Luiz    20.0  2019 season

In [34]:
# outer join
df2.join(df3, how="outer")

   Team Name  Point      Seasons       Players  Points       Season
L1   Man Utd   92.0  2012 season           NaN     NaN          NaN
L2   Arsenal   70.0  2013 season  Wayne Rooney   100.0  2018 season
L3   Chelsea   83.0  2015 season    David Luiz    20.0  2019 season
L4       NaN    NaN          NaN  Ross Barkley    40.0  2015 season

## Concatinate two DFs with Pandas

In [35]:
pd.concat([df2,df3])

   Team Name  Point      Seasons       Players  Points       Season
L1   Man Utd   92.0  2012 season           NaN     NaN          NaN
L2   Arsenal   70.0  2013 season           NaN     NaN          NaN
L3   Chelsea   83.0  2015 season           NaN     NaN          NaN
L2       NaN    NaN          NaN  Wayne Rooney   100.0  2018 season
L3       NaN    NaN          NaN    David Luiz    20.0  2019 season
L4       NaN    NaN          NaN  Ross Barkley    40.0  2015 season